---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.ShowContourLines
source: html/7f575469-873e-b8ce-3f37-0ade104e3e32.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.ShowContourLines Property

If true, show contour lines in the analysis display.

## Syntax (C#)
```csharp
public bool ShowContourLines { get; set; }
```